<a href="https://colab.research.google.com/github/edcalderin/BigDataEngineering_ICARO/blob/master/TP_Integrador.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Trabajo integrador

## Parte 1

**Objetivo**: El objetivo de la Parte 1 consta de dos secciones que se deberán resolver utilizando python (request, pandas, etc.) y PostgreSQL.


1.   Consultar una base de datos relacional (sistema OLTP) en Postgres siguiendo el DER (diagrama de entidad relación) propuesto.
2.   Construir, consultar y persistir (en csv) una tabla denormalizada (más adelante se aclara su formato) con datos agrupados por distintas categorías.

### Seccion 1

##### Creando conexión a Postgres

In [ ]:
from sqlalchemy import create_engine
import pandas as pd

In [ ]:
def getPostgresConnection(stringConnection='postgresql+psycopg2://postgres:postgres@db-test.cq4syw9xqygb.us-east-1.rds.amazonaws.com/postgres'):
    return create_engine(stringConnection)

Test conexion

In [ ]:
connector = getPostgresConnection()
with connector.connect() as connection:
    result = connection.execute('SELECT VERSION()')
    print(result.fetchone())

('PostgreSQL 12.5 on x86_64-pc-linux-gnu, compiled by gcc (GCC) 4.8.5 20150623 (Red Hat 4.8.5-11), 64-bit',)

##### Consultas a la base de datos

Creando objeto global

In [ ]:
connector = getPostgresConnection()

###### 1. Cantidad de ventas totales

In [ ]:
with connector.connect() as connection:
    result = connection.execute('SELECT COUNT(*) FROM Ventas')
    print(f'{result.fetchone()[0]} ventas totales')

100 ventas totales

###### 2. Cantidad de clientes totales.

In [ ]:
with connector.connect() as connection:
    result = connection.execute('SELECT COUNT(*) FROM Clientes')
    print(f'{result.fetchone()[0]} clientes totales')

5 clientes totales

###### 3. Cantidad de clientes por región (mostrando la región, no el id)

In [ ]:
query = '''
        SELECT R.region, COUNT(C.id_region) AS cantidad_clientes FROM Clientes C
        INNER JOIN Regiones R USING (id_region)
        GROUP BY(R.region)
        '''
pd.read_sql(query, connector)

  region  cantidad_clientes
0    Sur                  3
1  Norte                  2

###### 4. Cantidad de productos por categoría (mostrando la categoría, no el id)

In [ ]:
with connector.connect() as connection:
    query = '''
            SELECT nombre_categoria, COUNT(id_producto) FROM Productos
            INNER JOIN Categoria_Producto USING (id_categoria_producto)
            GROUP BY(nombre_categoria)
            '''
    result = connection.execute(query)
    for item in result.fetchall():
        print(item)

('Smartphone', 5)
('Hogar', 2)
('Computacion', 2)

###### 5. Cantidad de ventas por región

In [ ]:
query = '''
        SELECT R.region, COUNT(C.id_region) AS cantidad_ventas FROM Ventas V
        INNER JOIN Clientes C ON V.id_cliente = C.id_cliente
        INNER JOIN Regiones R ON R.id_region = C.id_region
        GROUP BY (R.region)
        '''
pd.read_sql(query, connector)

  region  cantidad_ventas
0    Sur               83
1  Norte               17

###### 6. Producto más vendido en cada región

In [ ]:
query = '''
        DROP VIEW IF EXISTS venta_producto_view;
        CREATE VIEW venta_producto_view AS
        (
            SELECT id_cliente, id_venta, id_producto, nombre_producto FROM Ventas V
            INNER JOIN Ventas_Productos VP USING (id_venta)
            INNER JOIN Productos P USING (id_producto)
        );
        SELECT * FROM venta_producto_view
        '''
pd.read_sql(query, connector).head()

   id_cliente  id_venta  id_producto nombre_producto
0           3        90            1        Iphone X
1           5        89            1        Iphone X
2           5        82            1        Iphone X
3           5        80            1        Iphone X
4           3        77            1        Iphone X

In [ ]:
query = '''
        DROP VIEW IF EXISTS cliente_region_view;
        CREATE VIEW cliente_region_view AS
        (
            SELECT id_cliente, id_region, region FROM Clientes C
            INNER JOIN Regiones R USING (id_region)
        );
        SELECT * FROM cliente_region_view
        '''
pd.read_sql(query, connector)

   id_cliente  id_region region
0           1          1  Norte
1           2          1  Norte
2           3          2    Sur
3           4          2    Sur
4           5          2    Sur

In [ ]:
query = '''
        DROP VIEW IF EXISTS region_cantidad_produto_view;
        CREATE VIEW region_cantidad_produto_view AS (
            SELECT region, nombre_producto, COUNT(nombre_producto) AS cantidad FROM venta_producto_view
            INNER JOIN cliente_region_view 
            USING (id_cliente) 
            GROUP BY (region, nombre_producto)
        );
        SELECT * FROM region_cantidad_produto_view
    '''
pd.read_sql(query, connector).head()

  region            nombre_producto  cantidad
0  Norte                 Monito 27"         1
1    Sur                 Monito 27"        12
2  Norte                   RAM 8GB          2
3  Norte                    Moto G9         2
4  Norte  Lavarropas Drean Next Eco         2

In [ ]:
query = ''' 
        SELECT region, nombre_producto FROM (
            SELECT region, MAX(cantidad) cant_max FROM region_cantidad_produto_view
            GROUP BY region
        ) region_max
        INNER JOIN region_cantidad_produto_view USING (region)
        WHERE cantidad = cant_max
        '''
pd.read_sql(query, connector)

  region nombre_producto
0  Norte        Iphone 7
1    Sur        Iphone X
2  Norte         Moto E9

###### 7. Cliente con más productos comprados por región

In [ ]:
query = '''
        DROP VIEW IF EXISTS region_client_prod;
        CREATE VIEW region_client_prod AS (
            SELECT region, Id_cliente, cant_products FROM (
                SELECT Id_cliente, region, COUNT(*) as cant_products FROM venta_producto_view
                INNER JOIN cliente_region_view USING (Id_cliente)
                GROUP BY (region, Id_cliente)
            ) region_cant_prods
        );
        SELECT * FROM region_client_prod
        '''
pd.read_sql(query, connector)

  region  id_cliente  cant_products
0    Sur           3             53
1  Norte           1             11
2  Norte           2              6
3    Sur           5             23
4    Sur           4              7

In [ ]:
query = '''
        SELECT region, nombre, apellido FROM (
            SELECT region, MAX(cant_products) AS cant_prod FROM region_client_prod
            GROUP BY (region)
        ) subquery1
        INNER JOIN region_client_prod USING (region)
        INNER JOIN Clientes USING (Id_cliente)
        WHERE cant_prod = cant_products
        '''
pd.read_sql(query, connector)

  region  nombre apellido
0    Sur  Homero  Simpson
1  Norte    Juan    Perez

###### 8. Cliente que más gasta por región

In [ ]:
query = '''
        DROP VIEW IF EXISTS price_client_region_view;
        CREATE VIEW price_client_region_view AS (
            SELECT (nombre || ' ' || apellido) AS full_name, region, sum_precio FROM cliente_region_view
            INNER JOIN (
                SELECT id_cliente, SUM(precio) AS sum_precio FROM venta_producto_view
                INNER JOIN Productos USING (id_producto)
                GROUP BY id_cliente) subquery
            USING (id_cliente)
            INNER JOIN Clientes USING (id_cliente)
        );
        SELECT * FROM price_client_region_view            
        '''
pd.read_sql(query, connector)

          full_name region  sum_precio
0        Juan Perez  Norte      2490.0
1    Nicolas Garcia  Norte      1230.0
2    Homero Simpson    Sur     24470.0
3  Carlos Hernandez    Sur      2310.0
4     Paula Herrera    Sur     10230.0

In [ ]:
query = '''
        SELECT region, full_name, sum_precio FROM price_client_region_view
        INNER JOIN (
            SELECT region, MAX(sum_precio) AS total FROM price_client_region_view
            GROUP BY region
        ) grouped_by_region
        USING (region)
        WHERE sum_precio = total           
        '''
pd.read_sql(query, connector)

  region       full_name  sum_precio
0  Norte      Juan Perez      2490.0
1    Sur  Homero Simpson     24470.0

###### 9. Monto total de ventas por categoría de producto (mostrando la categoría, no el id)

In [ ]:
query = '''
        DROP VIEW IF EXISTS category_products_venta_view;
        CREATE VIEW category_products_venta_view AS (
            SELECT id_categoria_producto, precio FROM Ventas_Productos 
            INNER JOIN Productos USING (id_producto)
        );
        SELECT * FROM category_products_venta_view
        '''
pd.read_sql(query, connector).head()

   id_categoria_producto  precio
0                      1    1000
1                      1    1000
2                      1    1000
3                      1    1000
4                      1    1000

In [ ]:
query = '''
        SELECT nombre_categoria, total FROM Categoria_Producto 
        INNER JOIN (
            SELECT id_categoria_producto, SUM(precio) AS total FROM category_products_venta_view
            GROUP BY id_categoria_producto
        ) subquery
        USING (id_categoria_producto)
        ORDER BY total DESC
        '''
pd.read_sql(query, connector)

  nombre_categoria    total
0       Smartphone  35100.0
1            Hogar   2910.0
2      Computacion   2720.0

##### Dropping Views

In [ ]:
with connector.connect() as connection:
    # Eliminando vistas a partir de la última creada
    query = '''
            DROP VIEW IF EXISTS category_products_venta_view;
            DROP VIEW IF EXISTS price_client_region_view;
            DROP VIEW IF EXISTS region_client_prod;
            DROP VIEW IF EXISTS region_cantidad_produto_view;
            DROP VIEW IF EXISTS cliente_region_view;
            DROP VIEW IF EXISTS venta_producto_view;
            '''
    result = connection.execute(query)

### Sección 2

#### Construcción

Armar una tabla temporal en Postgres (para nombrar la tabla usen la regla nombre_apellido_DESC donde DESC lo deben reemplazar con la
descripción de la tabla que les parezca, por ejemplo “ventas_acumuladas”,
es decir, en mi caso mohamed_rios_ventas_acumuladas), a partir de las
tablas de la sección 1, con los siguientes campos:

*   Año de la venta
*   Mes de la venta
*   Región
*   Categoría de producto
*   Producto
*   Ventas acumuladas en ese mes para esa categoría
*   Ventas acumuladas en ese mes para ese producto

In [ ]:
query = '''
        DROP VIEW IF EXISTS ventas_acumuladas_view;
        CREATE VIEW ventas_acumuladas_view AS (
           SELECT
                VP.id_venta,
                TO_CHAR(CAST(fecha_de_venta AS DATE), 'YYYY') "year",
                TO_CHAR(CAST(fecha_de_venta AS DATE), 'MM') "month",
                TO_CHAR(CAST(fecha_de_venta AS DATE), 'DD') "day",
                region,
                nombre_categoria,
                nombre_producto
           FROM Ventas_Productos VP
           INNER JOIN Ventas V ON VP.id_venta = V.id_venta
           INNER JOIN Productos USING (id_producto)
           INNER JOIN Categoria_Producto USING (id_categoria_producto)
           INNER JOIN Clientes USING (id_cliente)
           INNER JOIN Regiones USING (id_region)
        );
        SELECT * FROM ventas_acumuladas_view
        '''
df = pd.read_sql(query, connector)
print(df.shape)
print(df.head())

(100, 7)
   id_venta  year month day region nombre_categoria nombre_producto
0        11  2020    10  18    Sur       Smartphone     Samsung S20
1        24  2020    11  02    Sur       Smartphone     Samsung S20
2        28  2020    11  02    Sur       Smartphone     Samsung S20
3        29  2020    11  02    Sur       Smartphone     Samsung S20
4        38  2020    11  03    Sur       Smartphone     Samsung S20

In [ ]:
query = '''
        DROP TABLE IF EXISTS erick_calderin_ventas_acumuladas;
        CREATE TEMP TABLE erick_calderin_ventas_acumuladas AS (
               SELECT
                year,
                month,
                nombre_categoria, 
                nombre_producto,
                region,
                COUNT(*) AS ventas_mes_categoria
               FROM ventas_acumuladas_view 
               GROUP BY 1, 2, 3, 4, 5
        );
        SELECT * FROM erick_calderin_ventas_acumuladas
        '''
pd.read_sql(query, connector)

    year month  ... region ventas_mes_categoria
0   2020    10  ...  Norte                    1
1   2020    10  ...    Sur                    2
2   2020    10  ...  Norte                    1
3   2020    10  ...  Norte                    1
4   2020    10  ...    Sur                    1
5   2020    10  ...  Norte                    2
6   2020    10  ...    Sur                    1
7   2020    10  ...    Sur                    2
8   2020    10  ...  Norte                    4
9   2020    10  ...    Sur                    2
10  2020    10  ...  Norte                    1
11  2020    10  ...    Sur                    1
12  2020    10  ...    Sur                    1
13  2020    11  ...    Sur                   10
14  2020    11  ...  Norte                    2
15  2020    11  ...    Sur                    2
16  2020    11  ...  Norte                    1
17  2020    11  ...    Sur                    9
18  2020    11  ...  Norte                    1
19  2020    11  ...    Sur                    4
20  2020    11  ...  Norte                    2
21  2020    11  ...    Sur                    7
22  2020    11  ...    Sur                   13
23  2020    11  ...    Sur                    6
24  2020    11  ...  Norte                    1
25  2020    11  ...    Sur                   12
26  2020    11  ...    Sur                   10

[27 rows x 6 columns]

#### Consultas

Realizar las siguientes consultas:
* Región con más ventas por cada año y mes.
* Categoría de producto con más ventas por cada año y mes.
* Producto más vendido en cada mes, por cada región y categoría de
producto existente.

##### Región con más ventas por cada año y mes

In [ ]:
query = '''
        SELECT year, month, region, MAX(ventas_mes_categoria) AS total_ventas 
        FROM erick_calderin_ventas_acumuladas
        GROUP BY year, month, region
        ORDER BY year, month, region
        '''
pd.read_sql(query, connector)

   year month region  total_ventas
0  2020    10  Norte             4
1  2020    10    Sur             2
2  2020    11  Norte             2
3  2020    11    Sur            13

##### Categoría de producto con más ventas por cada año y mes.

In [ ]:
query = '''
        SELECT year, month, nombre_categoria, MAX(ventas_mes_categoria) AS total_ventas 
        FROM erick_calderin_ventas_acumuladas
        GROUP BY year, month, nombre_categoria
        ORDER BY year, month
        '''
pd.read_sql(query, connector)

   year month nombre_categoria  total_ventas
0  2020    10            Hogar             1
1  2020    10      Computacion             2
2  2020    10       Smartphone             4
3  2020    11            Hogar             9
4  2020    11      Computacion            10
5  2020    11       Smartphone            13

##### Producto más vendido en cada mes, por cada región y categoría de producto existente.

In [ ]:
query = '''
        SELECT month, region, nombre_categoria, nombre_producto, MAX(ventas_mes_categoria) AS total_ventas 
        FROM erick_calderin_ventas_acumuladas        GROUP BY month, nombre_producto, region, nombre_categoria
        ORDER BY month, region
        '''
pd.read_sql(query, connector)

   month region nombre_categoria            nombre_producto  total_ventas
0     10  Norte       Smartphone                   Iphone 7             2
1     10  Norte      Computacion                 Monito 27"             1
2     10  Norte            Hogar          Cocina Electrolux             1
3     10  Norte       Smartphone                    Moto G9             1
4     10  Norte       Smartphone                    Moto E9             4
5     10  Norte            Hogar  Lavarropas Drean Next Eco             1
6     10    Sur       Smartphone                    Moto E9             2
7     10    Sur       Smartphone                   Iphone 7             1
8     10    Sur       Smartphone                    Moto G9             1
9     10    Sur      Computacion                 Monito 27"             2
10    10    Sur       Smartphone                Samsung S20             1
11    10    Sur            Hogar  Lavarropas Drean Next Eco             1
12    10    Sur       Smartphone                   Iphone X             2
13    11  Norte            Hogar  Lavarropas Drean Next Eco             1
14    11  Norte       Smartphone                   Iphone 7             2
15    11  Norte       Smartphone                    Moto G9             1
16    11  Norte      Computacion                   RAM 8GB              2
17    11  Norte            Hogar          Cocina Electrolux             1
18    11    Sur      Computacion                 Monito 27"            10
19    11    Sur            Hogar          Cocina Electrolux             9
20    11    Sur       Smartphone                    Moto G9            12
21    11    Sur      Computacion                   RAM 8GB              2
22    11    Sur       Smartphone                Samsung S20            10
23    11    Sur       Smartphone                   Iphone 7             7
24    11    Sur       Smartphone                    Moto E9             6
25    11    Sur       Smartphone                   Iphone X            13
26    11    Sur            Hogar  Lavarropas Drean Next Eco             4

#### Persistencia

Obtener el acumulado de ventas por año y mes y luego escribir el resultado
en un csv.

In [ ]:
query = '''
        SELECT year, month, SUM(ventas_mes_categoria) AS total_ventas 
        FROM erick_calderin_ventas_acumuladas
        GROUP BY year, month
        ORDER BY year, month
        '''
acumulado_ventas_df = pd.read_sql(query, connector)
acumulado_ventas_df.to_csv('acumulado_ventas.csv')

#### Drop

In [ ]:
with connector.connect() as connection:
    query = '''
            DROP VIEW IF EXISTS ventas_acumuladas_view;
            DROP TABLE IF EXISTS erick_calderin_ventas_acumuladas;
            '''
    result = connection.execute(query)

## Parte 2

### Seteo de entorno

In [3]:
%%bash
apt-get install openjdk-8-jdk-headless -qq > /dev/null
wget -q http://www-us.apache.org/dist/spark/spark-2.4.7/spark-2.4.7-bin-hadoop2.7.tgz
tar xf spark-2.4.7-bin-hadoop2.7.tgz
pip install -q findspark

In [4]:
import os
os.environ['JAVA_HOME'] = '/usr/lib/jvm/java-8-openjdk-amd64'
os.environ['SPARK_HOME'] = '/content/spark-2.4.7-bin-hadoop2.7'
import findspark
findspark.init()
from pyspark.sql import SparkSession
spark = SparkSession.builder.getOrCreate()

In [5]:
!wget -q https://jdbc.postgresql.org/download/postgresql-42.2.19.jar #Acá podemos buscar la versión que querramos

In [6]:
!ls

postgresql-42.2.19.jar	   spark-2.4.7-bin-hadoop2.7.tgz
sample_data		   spark-2.4.7-bin-hadoop2.7.tgz.1
spark-2.4.7-bin-hadoop2.7

In [7]:
from pyspark import SparkConf
conf = SparkConf()
conf.set('spark.jars', 'postgresql-42.2.19.jar')

Creo el SparkSession aplicando la configuración para conectarme a postgres:

In [9]:
spark = SparkSession.builder.config(conf=conf).getOrCreate()

### Lectura de tablas

In [ ]:
ventasDF = spark.read
            .format('jdbc')
            .option('driver', 'org.postgres.Driver')
            .option('url', '')